clear


a=1;
b=3;

N=800;

%龙贝格求积算法系数
R=[0.038271604938272
   0.180599647266314
   0.062081128747795
   0.180599647266314
   0.076895943562610
   0.180599647266314
   0.062081128747795
   0.180599647266314
   0.038271604938272]';



K=N/8;     %把[a,b]一共分成K个小区间，每个小区间用龙贝格求积算法计算积分

Nk=N/K;           %8等分，Nk=8,因为龙贝格算法实际上是N=8
tt=-1:2/Nk:1;     %8等分点
    

aa=a:(b-a)/K:b;     %把[a,b]一共分成K个小区间，每个小区间用龙贝格求积算法计算积分
x=[];
w=[];

for k=1:K
    x0=[aa(k)+(aa(k+1)-aa(k))/2*(tt+1)];      %每个小区间上的8等分点
    x=[x,x0];    %保存剖分点
    
    w0=(aa(k+1)-aa(k))*R;      %每个小区间上的求积系数
    w=[w,w0];
end



y=fun(x);

I=y*w';


error=abs(I-62/3)

